node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999974752427e-07
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 3.1415927410125732
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 5
          }
        }
        string_val: "./test_condition_results/Neutral/5_happiness.bin"
        string_val: "./test_condition_results/Neutral/23_happiness.bin"
        string_val: "./test_condition_results/Neutral/19_happiness.bin"
        string_val: "./test_condition_results/Neutral/4_happiness.bin"
        string_val: "./test_condition_results/Neutral/6_happiness.bin"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Size"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 5
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Greater/y"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Greater"
  op: "Greater"
  input: "InputPipline/input_producer/Size"
  input: "InputPipline/input_producer/Greater/y"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Assert/data_0"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Assert"
  op: "Assert"
  input: "InputPipline/input_producer/Greater"
  input: "InputPipline/input_producer/Assert/Assert/data_0"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "InputPipline/input_producer/Identity"
  op: "Identity"
  input: "InputPipline/input_producer/Const"
  input: "^InputPipline/input_producer/Assert/Assert"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/RandomShuffle"
  op: "RandomShuffle"
  input: "InputPipline/input_producer/Identity"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs"
  op: "VariableV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs/Assign"
  op: "Assign"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  input: "InputPipline/input_producer/limit_epochs/Const"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs/read"
  op: "Identity"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/CountUpTo"
  op: "CountUpTo"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "limit"
    value {
      i: 1
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs"
  op: "Identity"
  input: "InputPipline/input_producer/RandomShuffle"
  input: "^InputPipline/input_producer/limit_epochs/CountUpTo"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer"
  op: "FIFOQueueV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "InputPipline/input_producer"
  input: "InputPipline/input_producer/limit_epochs"
  device: "/device:CPU:*"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Close"
  op: "QueueCloseV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Close_1"
  op: "QueueCloseV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Size"
  op: "QueueSizeV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Cast"
  op: "Cast"
  input: "InputPipline/input_producer/input_producer_Size"
  device: "/device:CPU:*"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/mul/y"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/mul"
  op: "Mul"
  input: "InputPipline/input_producer/Cast"
  input: "InputPipline/input_producer/mul/y"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/fraction_of_32_full/tags"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "InputPipline/input_producer/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/fraction_of_32_full"
  op: "ScalarSummary"
  input: "InputPipline/input_producer/fraction_of_32_full/tags"
  input: "InputPipline/input_producer/mul"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/WholeFileReaderV2"
  op: "WholeFileReaderV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/ReaderReadV2"
  op: "ReaderReadV2"
  input: "InputPipline/WholeFileReaderV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/DecodeRaw"
  op: "DecodeRaw"
  input: "InputPipline/ReaderReadV2:1"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "little_endian"
    value {
      b: true
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "InputPipline/Reshape/shape"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\005\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/Reshape"
  op: "Reshape"
  input: "InputPipline/DecodeRaw"
  input: "InputPipline/Reshape/shape"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1029
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\002\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice/stack"
  input: "InputPipline/strided_slice/stack_1"
  input: "InputPipline/strided_slice/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\002\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_1/stack"
  input: "InputPipline/strided_slice_1/stack_1"
  input: "InputPipline/strided_slice_1/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_2/stack"
  input: "InputPipline/strided_slice_2/stack_1"
  input: "InputPipline/strided_slice_2/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_3/stack"
  input: "InputPipline/strided_slice_3/stack_1"
  input: "InputPipline/strided_slice_3/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\005\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_4/stack"
  input: "InputPipline/strided_slice_4/stack_1"
  input: "InputPipline/strided_slice_4/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/Cast"
  op: "Cast"
  input: "InputPipline/strided_slice_4"
  device: "/device:CPU:*"
  attr {
    key: "DstT"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "sub/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 513
          }
        }
        tensor_content: "\375Y\232\300xZ\232\300f\\\232\300\033\\\232\300\257Z\232\300\341Z\232\300\216\\\232\300\r_\232\300\314j\232\300\226p\232\300\300~\232\300@\215\232\300\017\243\232\300\036\244\232\300\033\250\232\3007\247\232\300[\241\232\300\276\226\232\300\301\213\232\300\227\216\232\300h\226\232\300v\254\232\300 \327\232\300P\030\233\300\201O\233\300W\223\233\300b\337\233\300\314K\234\300\031\240\234\300/\030\235\300\330\232\235\300,E\236\300\007$\237\300k\027\240\300\3751\241\300\355\\\242\300\035\224\243\300\214\356\244\300\274T\246\300\336\300\247\300\304K\251\300o\360\252\300\316\272\254\300\305\262\256\300w\333\260\300\371\023\263\300\350L\265\300t\\\267\300:b\271\300\3312\273\300\331\310\274\300\226\022\276\300\3242\277\300Q\035\300\300|\372\300\300\001\263\301\3007V\302\300n\341\302\300\034G\303\300\003\250\303\300\234\355\303\300:/\304\300Gc\304\300\304\233\304\300f\313\304\300\340\320\304\300\277\353\304\300\177\374\304\300\001\036\305\300\207G\305\300\007{\305\300\372\310\305\300\204#\306\300\021~\306\300}\354\306\300\244u\307\300M\367\307\300d\210\310\300\373\n\311\300\273\220\311\3008\033\312\300!\261\312\300\360J\313\300\317\377\313\300A\265\314\300|`\315\300\347\'\316\300B\317\316\300\235]\317\300\n\330\317\300\231V\320\300\361\260\320\300\013\"\321\300^j\321\300\031\267\321\300 \372\321\300VG\322\300?\232\322\3005\005\323\300[\207\323\300*\031\324\300k\267\324\300\033V\325\300/\371\325\300\343\205\326\300sB\327\300Y\376\327\300.\254\330\300\242F\331\300R\373\331\300\242\273\332\300pi\333\300\334\006\334\300\372\220\334\300\271\032\335\300\016\252\335\300\220\033\336\300r\214\336\300 \351\336\300\366I\337\300\303\255\337\300\225\t\340\300M[\340\300\250\231\340\300u\306\340\300\333\366\340\300\361\t\341\300\221\017\341\300\3019\341\300hL\341\300\275[\341\300}\214\341\300k\256\341\300[\315\341\300Q\003\342\300\322\025\342\300\341<\342\300ad\342\300\215\224\342\300\255\326\342\300~\373\342\300}\034\343\300QK\343\300}z\343\300\254\242\343\300\231\261\343\300\316\324\343\300\356\364\343\300\343(\344\300\204p\344\300j\273\344\300\262\005\345\300\003`\345\300\224\301\345\300\353.\346\300\207\236\346\300\322\037\347\300\332\233\347\300G2\350\300\343\263\350\300\252I\351\300M\353\351\300\255\200\352\300\026,\353\300u\275\353\300G%\354\300c\221\354\300(\377\354\300\364c\355\300\007\264\355\300\365\355\355\300$\031\356\300=>\356\300\325b\356\300\357o\356\300\270{\356\300-\200\356\300\203\221\356\300\261\256\356\300m\273\356\300f\271\356\300\021\341\356\300\n\370\356\300\001\035\357\300??\357\300}[\357\300\232\203\357\300\255\312\357\300\254\023\360\300ik\360\300\246\277\360\3002\371\360\300\204\\\361\300\001\270\361\300\341\020\362\300\221p\362\300\267\274\362\300\036\036\363\300\245\204\363\300u\326\363\300\257-\364\300\374\217\364\300m\347\364\300\347D\365\300\313\255\365\300w\031\366\300\373z\366\300Y\323\366\300\332-\367\300\260\212\367\300\362\350\367\300\315P\370\300\337\250\370\300\337\027\371\300\236k\371\300\256\321\371\300\2054\372\300\025\247\372\300\004\004\373\300\005Z\373\300\320\322\373\300\2307\374\300\231\203\374\300W\347\374\300GI\375\300R\252\375\300\212\014\376\300\355d\376\300Y\272\376\300\315\037\377\300\003w\377\300\024\346\377\300\271!\000\301\320F\000\301Nl\000\301:}\000\301\317\231\000\301\035\233\000\301=\241\000\301!\217\000\301\273{\000\301\264d\000\301 O\000\301\340)\000\301\377\017\000\301\352\324\377\300p\244\377\300\330\206\377\300\231\203\377\3002\243\377\300\313\305\377\300\311\364\377\300\340\031\000\301\321J\000\3019r\000\301\314\223\000\301e\260\000\301\260\313\000\301\200\351\000\301\214\003\001\301-\034\001\301N<\001\301\214V\001\301\ny\001\301n\231\001\301\204\301\001\301n\351\001\301\241!\002\301RZ\002\301\023\223\002\301y\301\002\301\301\000\003\301`.\003\301\003j\003\301\255\231\003\3011\321\003\301\352\000\004\301sE\004\301\261p\004\301\213\235\004\301e\322\004\301\234\000\005\301t!\005\301\3656\005\301o]\005\301\022x\005\301\273\230\005\301\241\272\005\301\335\334\005\3012\010\006\301\032*\006\301wD\006\301\333e\006\301]\216\006\301|\257\006\301Z\337\006\301w\010\007\301V-\007\301\244P\007\301\035y\007\301\275\241\007\301\375\306\007\301\234\347\007\301s\023\010\301\210;\010\301\353c\010\301<\212\010\301\241\252\010\301z\312\010\301\250\345\010\301\016\006\t\301\221 \t\301\204@\t\301Lh\t\301\271\205\t\301#\246\t\301\354\317\t\301\007\360\t\301X\005\n\301\353\033\n\301v9\n\3014F\n\301#_\n\301\336v\n\301\327\221\n\301\270\255\n\301\270\321\n\301\344\356\n\301\331\004\013\301G\034\013\301u=\013\301Od\013\301y\212\013\301L\256\013\301\322\316\013\301$\356\013\301(\016\014\301\\7\014\301\226V\014\301\001}\014\301F\241\014\301f\304\014\301C\336\014\301\210\366\014\301=\021\r\301\337&\r\301LF\r\301F`\r\301\303|\r\301i\233\r\301P\273\r\301\311\341\r\301\225\374\r\301\022\027\016\301+-\016\301\357<\016\301=a\016\301\302|\016\301\263\227\016\301`\256\016\301\356\300\016\301J\317\016\3011\332\016\301\351\352\016\301\320\365\016\301S\004\017\301\001\n\017\301\333\n\017\301{\017\017\301r\030\017\301>&\017\301\032)\017\301\2342\017\301c2\017\301\0029\017\301I5\017\301A>\017\301\3028\017\301\353@\017\301\327L\017\301PT\017\301\227Z\017\301ei\017\301\237m\017\301\274p\017\301\017q\017\301\202r\017\301/o\017\301qf\017\301\364l\017\301\265r\017\301\351\177\017\301\347\210\017\301\236\230\017\301u\257\017\301d\300\017\301\027\320\017\301\242\330\017\301N\353\017\301\013\367\017\301\312\r\020\301\311\032\020\301>,\020\301N=\020\301\021Q\020\301\265_\020\3010q\020\301\301\207\020\301\001\252\020\301\274\304\020\301\307\332\020\301\352\372\020\301\334\017\021\301\310\'\021\301\255?\021\301MQ\021\301\274b\021\301Zn\021\301\346x\021\301#~\021\301\202\212\021\301\273\216\021\301\242\220\021\301S\221\021\301n\227\021\301\200\226\021\301\331\234\021\301\315\234\021\301w\236\021\301B\243\021\301\213\247\021\301\351\246\021\301\357\244\021\301\331\245\021\301\335\235\021\301\001\244\021\301,\240\021\301<\226\021\301\003\232\021\301\037\220\021\301\302\202\021\301\006u\021\301\230m\021\301QY\021\301\302J\021\301Z+\021\301N\023\021\301\\\002\021\301\'\362\020\301Y\333\020\301o\307\020\301\255\253\020\301\355\227\020\301\346z\020\301\215c\020\301\000I\020\301\3009\020\301\031\037\020\301\273\023\020\301\263\376\017\301\260\357\017\301\264\337\017\301\311\316\017\301\207\315\017\301\"\310\017\301\177\312\017\301U\327\017\301\306\337\017\301\231\352\017\301\203\003\020\301\006%\020\3010O\020\301\265\207\020\301\026\312\020\301e\017\021\301\301j\021\301\322\343\021\301\234f\022\301\256\004\023\301j\276\023\301p\217\024\301\277\207\025\301\305\237\026\301\204\330\027\301\376-\031\301P\251\032\301\332D\034\301\354\004\036\301\320\356\037\301b\373!\301T@$\301w\243&\3016/)\301\036\340+\301\377\272.\301R\2651\301\324\3244\301(\0268\301\277\200;\301E\010?\301\"\244B\301\001TF\301\355\001J\301\354\262M\301\305]Q\301\222\355T\301KcX\301\204\250[\301\312\240^\301\000-a\301\346+c\301eld\301\220\337d\301"
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "InputPipline/strided_slice"
  input: "sub/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "truediv/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 513
          }
        }
        tensor_content: "\251\263j@\205\"k@LQl@\351\323m@QYo@\315\256p@q\243q@m\257q@\2058p@K\325m@\250\303k@\234\377j@*\nl@\211\205n@\275\347q@^lr@\371\177p@\353`n@\031nn@9\rp@\256\270q@v\353r@>\327s@P,u@\266\220v@\n)w@\237?w@~\235w@\004;x@\3217y@&Cz@H\212{@M\361|@\352s~@u\351\177@\224n\200@q\353\200@l\263\201@\371\254\202@\255\232\203@\025w\204@HB\205@\000M\206@\032\223\207@\231\024\211@\237\200\212@\224\302\213@T\346\214@p\014\216@C\031\217@Z\001\220@m\226\220@\261\370\220@\211V\221@\'\260\221@8\354\221@\223\375\221@U\034\222@\2338\222@\351Y\222@2t\222@j\220\222@\246\255\222@\344\364\222@):\223@VZ\223@>\231\223@G\300\223@\223\023\224@\016\211\224@\326!\225@\242\367\225@x\322\226@O\243\227@\201p\230@\274<\231@:\321\231@8A\232@\316\221\232@\227\330\232@\207\021\233@\262T\233@eu\233@Q\246\233@\366\311\233@D\341\233@A \234@:B\234@2[\234@\356h\234@\"\215\234@\365\244\234@M\317\234@T\340\234@\026\020\235@\200S\235@\342\253\235@\232\035\236@\300\247\236@\331B\237@\037\376\237@\205\316\240@\301\253\241@@\225\242@Tg\243@\216b\244@\000Q\245@8+\246@+\363\246@\264\323\247@-\305\250@6\251\251@\342r\252@1,\253@\220\343\253@,\233\254@\006+\255@\300\271\255@\313/\256@\216\243\256@\004\032\257@,\203\257@\363\333\257@\350\017\260@\267,\260@K/\260@h\000\260@`\306\257@)\242\257@+J\257@w\340\256@\303\217\256@\337 \256@\006\256\255@\317C\255@\322\256\254@|\"\254@Z\227\253@\223\020\253@\235\242\252@\233\024\252@=\223\251@/.\251@\373\330\250@\345\213\250@\0244\250@\372\361\247@`\267\247@Q\245\247@\204\252\247@\302\266\247@\321\305\247@\266\354\247@o\025\250@XO\250@\270\200\250@\353\302\250@\356\376\250@RZ\251@0\241\251@\025\005\252@yo\252@\272\315\252@#>\253@\353\250\253@r\344\253@h\"\254@?k\254@\224\247\254@\334\326\254@\233\352\254@\314\367\254@z\002\255@\334\t\255@e\005\255@`\367\254@}\352\254@-\355\254@K\377\254@\372\375\254@\315\357\254@\357\027\255@\033:\255@\340b\255@\013\220\255@\330\276\255@G\372\255@\277T\256@m\273\256@\304-\257@\331\254\257@\316\014\260@\340\241\260@\356&\261@\256\251\261@\220>\262@\004\300\262@\347S\263@\032\360\263@\244u\264@k\001\265@\267\234\265@\267&\266@\270\272\266@\242Q\267@\\\351\267@\360t\270@\270\365\270@\244k\271@\014\341\271@\300P\272@C\312\272@F%\273@\367\233\273@\250\351\273@`E\274@\203\236\274@\262\003\275@]L\275@\255|\275@\227\320\275@R\r\276@Y \276@~Q\276@\007\177\276@\237\254\276@@\321\276@\206\352\276@\244\006\277@\033;\277@lf\277@\032\254\277@[\331\277@`\372\277@\347(\300@\2630\300@sN\300@\223D\300@PE\300@\202\036\300@\t\367\277@$\300\277@\001\225\277@YI\277@\005\035\277@l\322\276@\201\225\276@\342m\276@\357f\276@\347\221\276@A\270\276@x\357\276@RG\277@\010\315\277@\310D\300@\346\255\300@\361\034\301@\352\203\301@\245\356\301@eS\302@@\257\302@;\035\303@\002z\303@\246\354\303@\340Q\304@2\317\304@\3706\305@\310\274\305@\235@\306@\231\264\306@7\037\307@\202\240\307@\020\373\307@\271v\310@\235\337\310@dJ\311@l\243\311@\370(\312@dt\312@7\314\312@\r6\313@5\212\313@\034\312\313@\360\371\313@\2618\314@\340o\314@$\253\314@\315\346\314@5+\315@\007\202\315@e\315\315@\032\001\316@\035H\316@\276\237\316@\221\355\316@7P\317@\320\243\317@\306\361\317@;8\320@z\222\320@\241\361\320@RD\321@\256\217\321@:\356\321@\305N\322@\362\251\322@\352\374\322@cI\323@\346\235\323@\270\345\323@\3064\324@U}\324@\t\304\324@\211\030\325@\216b\325@B\252\325@\360\004\326@|S\326@2\210\326@\027\303\326@\304\016\327@^.\327@\022h\327@\'\251\327@\320\344\327@.\"\330@\246z\330@s\270\330@\217\356\330@\240#\331@\356b\331@|\260\331@\326\371\331@\346>\332@ \205\332@!\300\332@\343\364\332@\2438\333@\016i\333@:\233\333@#\320\333@s\374\333@m\026\334@s5\334@\260Z\334@@k\334@e\233\334@\262\277\334@)\347\334@\016\034\335@\220Q\335@\327\224\335@\032\306\335@\242\367\335@\026\"\336@\302B\336@\217\230\336@%\330\336@\327\024\337@vT\337@L\206\337@P\262\337@\350\323\337@F\004\340@\334 \340@hO\340@\205b\340@\305k\340@Q|\340@<\225\340@\364\270\340@B\305\340@\214\334\340@\333\327\340@\036\343\340@\333\324\340@@\341\340@Z\322\340@\222\350\340@\322\371\340@\317\376\340@c\006\341@R\032\341@p\032\341@3\030\341@\022\003\341@\337\372\340@@\347\340@-\306\340@\000\276\340@\275\255\340@\031\260\340@P\252\340@4\255\340@\340\274\340@T\266\340@4\264\340@C\240\340@\023\232\340@\024\217\340@c\212\340@\330|\340@\007\177\340@\203w\340@Oo\340@=a\340@\336O\340@\004Q\340@\323`\340@@k\340@bj\340@ \212\340@C\216\340@\312\243\340@\350\266\340@\207\273\340@\341\314\340@*\325\340@\217\341\340@\\\336\340@l\353\340@_\353\340@\321\351\340@\220\354\340@\251\377\340@\333\007\341@\022\036\341@\221\"\341@\322&\341@/<\341@\277P\341@ii\341@$y\341@{\233\341@\006\251\341@\262\324\341@\201\354\341@3\353\341@\242\024\342@k(\342@\336\'\342@N1\342@{K\342@\032E\342@\371P\342@\251<\342@\3043\342@\220E\342@\217G\342@\332Q\342@\345^\342@Ua\342@\032p\342@Hk\342@\236v\342@5\202\342@\021\247\342@\264\256\342@(\337\342@3\377\342@\356$\343@\205N\343@\233w\343@\326\276\343@\356\t\344@E`\344@\316\301\344@I\032\345@\207r\345@\342\332\345@PO\346@\226\313\346@\203[\347@\215\352\347@\320\203\350@f/\351@\032\014\352@4\347\352@g\345\353@\261\013\355@5H\356@\344\300\357@\303K\361@#\r\363@\370\333\364@v\324\366@\266\354\370@E\035\373@u|\375@e\367\377@:[\001AN\301\002Ai5\004A\014\273\005A\320V\007AP\t\tA\344\337\nA\026\357\014A\254Q\017A\356\370\021A\034\334\024A\345\375\027Ax=\033A\227\241\036Ab\n\"A\253p%A\321\307(A1\365+A\274\337.A\373a1A\200]3A\000\2334A\352\r5A"
      }
    }
  }
}
node {
  name: "truediv"
  op: "RealDiv"
  input: "sub"
  input: "truediv/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "clip_by_value/Minimum/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "clip_by_value/Minimum"
  op: "Minimum"
  input: "truediv"
  input: "clip_by_value/Minimum/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "clip_by_value/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "clip_by_value"
  op: "Maximum"
  input: "clip_by_value/Minimum"
  input: "clip_by_value/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 2.0
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "clip_by_value"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "sub_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "sub_1"
  op: "Sub"
  input: "mul"
  input: "sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims"
  op: "ExpandDims"
  input: "sub_1"
  input: "NH_to_NHWC/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims_1"
  op: "ExpandDims"
  input: "NH_to_NHWC/ExpandDims"
  input: "NH_to_NHWC/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Shape"
  op: "Shape"
  input: "NH_to_NHWC/ExpandDims_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice"
  op: "StridedSlice"
  input: "Shape"
  input: "strided_slice/stack"
  input: "strided_slice/stack_1"
  input: "strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "ones/Less/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "ones/Less"
  op: "Less"
  input: "strided_slice"
  input: "ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ones/packed"
  op: "Pack"
  input: "strided_slice"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "ones/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
